# Join Statements - Lab

## Introduction

In this lab, you'll practice your knowledge of join statements, using various types of joins and various methods for specifying the links between them.

## Objectives

You will be able to:
- Write queries that make use of various types of Joins
- Join tables using foreign keys

## CRM Schema

In almost all cases, rather then just working with a single table you will typically need data from multiple tables. 
Doing this requires the use of **joins ** using shared columns from the two tables. 

In this lab, you'll use the same Customer Relationship Management (CRM) database that you saw from the previous lesson.
<img src='images/Database-Schema.png' width="600">

## Connecting to the Database
Import the necessary packages and connect to the database **data.sqlite**.

In [1]:
#Your code here
import pandas as pd
import sqlite3
conn = sqlite3.connect('data.sqlite', detect_types=sqlite3.PARSE_COLNAMES)
c = conn.cursor()

## Display the names of all the employees in Boston.
Hint: join the employees and offices tables.

In [4]:
#Your code here
c.execute('''SELECT lastName, firstName FROM employees
            INNER JOIN offices using (officeCode) 
            WHERE city = 'Boston';''')
df = pd.DataFrame(c.fetchall())
df.columns = [x[0] for x in c.description]
df.head()

    lastName firstName
0   Firrelli     Julie
1  Patterson     Steve

## Do any offices have no employees?
Hint: Combine the employees and offices tables and use a group by.

In [14]:
#Your code here
c.execute('''SELECT  city, count(*) FROM offices
            INNER JOIN employees using (officecode)
            GROUP BY city ''')
df = pd.DataFrame(c.fetchall())
df.columns = [x[0] for x in c.description]
df.head()

            city  count(*)
0         Boston         2
1         London         2
2            NYC         2
3          Paris         5
4  San Francisco         6

## Write 3 Questions of your own and answer them

In [8]:
# which customer have the most order 
c.execute(''' SELECT CustomerName FROM customers
            INNER JOIN orders 
            ON customers.customerNumber = orders.customerNumber
            ORDER BY orderNumber DESC LIMIT 1''')
df = pd.DataFrame(c.fetchall())
df.columns = [x[0] for x in c.description]
df.head()

        customerName
0  La Rochelle Gifts

In [20]:
# which product name have more than 1000 quanity ordered 
c.execute('''SELECT productName, SUM(orderdetails.quantityOrdered) FROM products
            INNER JOIN orderdetails using (productCode)
            GROUP BY productName
            HAVING SUM(orderdetails.quantityOrdered) > 1000 ;''')
df =pd.DataFrame(c.fetchall())
df.columns = [x[0] for x in c.description]
df.head()

                    productName  SUM(orderdetails.quantityOrdered)
0         18th century schooner                               1011
1       1900s Vintage Tri-Plane                               1009
2   1913 Ford Model T Speedster                               1038
3  1930 Buick Marquette Phaeton                               1074
4          1937 Lincoln Berline                               1111

In [23]:
# Your code here
c.execute('''SELECT amount, customerNumber.creditLimit FROM payments
         INNER JOIN customers using (customerNumber);''')

OperationalError: no such column: customerNumber.creditLimit

## Level Up: Display the names of each product each employee has sold

In [ ]:
# Your code here

## Level Up: Display the Number of Products each employee has sold

In [ ]:
#Your code here

## Summary

Congrats! You now know how to use join statements, along with leveraging your foreign keys knowledge!